In [42]:
import pandas as pd
import numpy as np
import glob
import os

In [43]:
# Path to the directory containing your Parquet files
directory_path = 'C:/Users/comma/Github/workspace/sas-access-samples/SAS Foundation/parquetdataset/'

# Use glob to find all Parquet files in the directory
parquet_file_paths = glob.glob(directory_path + '*.parquet')

# Initialize an empty dictoionary to store the DataFrames
dfs = {}

In [44]:
# Function to decode bytes to string if the value is a byte literal
def decode_bytes(val):
    if isinstance(val, bytes):
        return val.decode('utf-8')
    return val

In [45]:
# Loop through the file paths
for path in parquet_file_paths:
    # Extract the base file name without the extension as the dictionary key
    file_name = path.split('/')[-1].replace('.parquet', '')
    
    # Read each file into a DataFrame
    df = pd.read_parquet(path)
    
    # Apply the decode_bytes function to each column using Series.map
    for col in df.columns:
        df[col] = df[col].map(decode_bytes)
    
    # Store the DataFrame in the dictionary with the file name as the key
    dfs[file_name] = df

In [46]:
df1 = dfs['parquetdataset\\samdat1']
df2 = dfs['parquetdataset\\samdat2']
df3 = dfs['parquetdataset\\samdat3']
df4 = dfs['parquetdataset\\samdat4']
df5 = dfs['parquetdataset\\samdat5']
df6 = dfs['parquetdataset\\samdat6']
df7 = dfs['parquetdataset\\samdat7']
df8 = dfs['parquetdataset\\samdat8']
df9 = dfs['parquetdataset\\samdat9']
df10 = dfs['parquetdataset\\samdat10']
df11 = dfs['parquetdataset\\samdat11']
df12 = dfs['parquetdataset\\samdat12']
df13 = dfs['parquetdataset\\samdat13']

In [47]:
df1.info()
df2.info()
df3.info()
df4.info()
df5.info()
df6.info()
df7.info()
df8.info()
df9.info()
df10.info()
df11.info()
df12.info()
df13.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 46 entries, 0 to 45
Data columns (total 8 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   FLIGHT    46 non-null     object
 1   DATES     46 non-null     datetime64[ns]
 2   DEPART    46 non-null     float64
 3   ORIG      46 non-null     object
 4   DEST      46 non-null     object
 5   MILES     46 non-null     float64
 6   BOARDED   46 non-null     float64
 7   CAPACITY  46 non-null     float64
dtypes: datetime64[ns](1), float64(4), object(3)
memory usage: 3.0+ KB
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 46 entries, 0 to 45
Data columns (total 7 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   FLIGHT    46 non-null     object
 1   DATES     46 non-null     datetime64[ns]
 2   ORIG      46 non-null     object
 3   DEST      46 non-null     object
 4   DELAYCAT  46 non-null     object
 5   DESTYPE   46 non-null     object
 6   DELAY     46 non-null     float64
dtypes: datetime64[ns](1), float64(1), object(5)
memory usage: 2.6+ KB
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 26 entries, 0 to 25
Data columns (total 4 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   FLIGHT   26 non-null     object
 1   DATES    26 non-null     datetime64[ns]
 2   DEST     26 non-null     object
 3   BOARDED  26 non-null     float64
dtypes: datetime64[ns](1), float64(1), object(2)
memory usage: 964.0+ bytes
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 156 entries, 0 to 155
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   FLIGHT  156 non-null    object
 1   DATES   156 non-null    datetime64[ns]
 2   DEST    156 non-null    object
 3   IDNUM   156 non-null    object
dtypes: datetime64[ns](1), object(3)
memory usage: 5.0+ KB
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 148 entries, 0 to 147
Data columns (total 6 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   IDNUM    148 non-null    object
 1   SEX      148 non-null    object
 2   JOBCODE  148 non-null    object
 3   SALARY   148 non-null    float64
 4   BIRTH    148 non-null    datetime64[ns]
 5   HIRED    148 non-null    datetime64[ns]
dtypes: datetime64[ns](2), float64(1), object(3)
memory usage: 7.1+ KB
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12 entries, 0 to 11
Data columns (total 6 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   IDNUM    12 non-null     object
 1   SEX      12 non-null     object
 2   JOBCODE  12 non-null     object
 3   SALARY   12 non-null     float64
 4   BIRTH    12 non-null     datetime64[ns]
 5   HIRED    12 non-null     datetime64[ns]
dtypes: datetime64[ns](2), float64(1), object(3)
memory usage: 708.0+ bytes
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 148 entries, 0 to 147
Data columns (total 6 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   IDNUM   148 non-null    object
 1   LNAME   148 non-null    object
 2   FNAME   148 non-null    object
 3   CITY    148 non-null    object
 4   STATE   148 non-null    object
 5   HPHONE  148 non-null    object
dtypes: object(6)
memory usage: 7.1+ KB
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 19 entries, 0 to 18
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   SUPID   19 non-null     object
 1   STATE   19 non-null     object
 2   JOBCAT  19 non-null     object
dtypes: object(3)
memory usage: 588.0+ bytes
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 17 entries, 0 to 16
Data columns (total 8 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   INVNUM    17 non-null     float64
 1   BILLEDTO  17 non-null     object
 2   AMTBILL   17 non-null     float64
 3   COUNTRY   17 non-null     object
 4   AMTINUS   17 non-null     float64
 5   BILLEDBY  17 non-null     float64
 6   BILLEDON  17 non-null     datetime64[ns]
 7   PAIDON    10 non-null     datetime64[ns]
dtypes: datetime64[ns](2), float64(4), object(2)
memory usage: 1.2+ KB
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 22 entries, 0 to 21
Data columns (total 11 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   EMPID     22 non-null     float64
 1   HIREDATE  22 non-null     datetime64[ns]
 2   SALARY    21 non-null     float64
 3   DEPT      22 non-null     object
 4   JOBCODE   22 non-null     float64
 5   GENDER    21 non-null     object
 6   BIRTHDTE  21 non-null     datetime64[ns]
 7   LASTNAME  22 non-null     object
 8   FRSTNAME  22 non-null     object
 9   MIDNAME   22 non-null     object
 10  PHONE     21 non-null     object
dtypes: datetime64[ns](2), float64(3), object(6)
memory usage: 2.0+ KB
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 21 entries, 0 to 20
Data columns (total 10 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   CUSTOMER  21 non-null     object
 1   STATE     11 non-null     object
 2   ZIPCODE   15 non-null     object
 3   COUNTRY   20 non-null     object
 4   PHONE     21 non-null     object
 5   NAME      20 non-null     object
 6   CONTACT   19 non-null     object
 7   ADDRESS   20 non-null     object
 8   CITY      20 non-null     object
 9   FIRSTORD  21 non-null     datetime64[ns]
dtypes: datetime64[ns](1), object(9)
memory usage: 1.8+ KB
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 38 entries, 0 to 37
Data columns (total 10 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   ORDERNUM  38 non-null     float64
 1   STOCKNUM  38 non-null     float64
 2   LENGTH    38 non-null     float64
 3   FABCHARG  24 non-null     float64
 4   SHIPTO    38 non-null     object
 5   DATEORD   38 non-null     datetime64[ns]
 6   SHIPPED   15 non-null     datetime64[ns]
 7   TAKENBY   38 non-null     float64
 8   PROCSBY   15 non-null     float64
 9   SPECFLAG  10 non-null     object
dtypes: datetime64[ns](2), float64(6), object(2)
memory usage: 3.1+ KB
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 8 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   EMPID     6 non-null      float64
 1   HIREDATE  6 non-null      datetime64[ns]
 2   DEPT      6 non-null      object
 3   GENDER    5 non-null      object
 4   LASTNAME  6 non-null      object
 5   FIRSTNAM  6 non-null      object
 6   MIDDLENA  5 non-null      object
 7   FAMILYID  2 non-null      float64
dtypes: datetime64[ns](1), float64(2), object(5)
memory usage: 516.0+ bytes

 /*=========================*/
 /* LIBNAME Sample 1       */
 /*=========================*/

proc print data=samples.SAMDAT7
   (keep=lname fname state hphone);
   where state = 'NJ';
   title 'Libname Sample 1: New Jersey Phone List';
run;

Intent Summary

This SAS code aims to filter a dataset named 'SAMDAT7' (located in the 'samples' library) for records where the state is 'NJ'. It then prints a selected subset of columns from the filtered data with the title 'Libname Sample 1: New Jersey Phone List'.

In [8]:
# Sample 1: New Jersey Phone List

import pandas as pd

# Assuming you have df7 loaded from your input mapping
df_filtered = df7[df7['STATE'] == 'NJ']  # Filtering for New Jersey records

# Select and rename columns (all to uppercase)
df_output = df_filtered[['LNAME', 'FNAME', 'STATE', 'HPHONE']]
df_output.columns = ['LNAME', 'FNAME', 'STATE', 'HPHONE'] 

# Display Result
print(df_output)

# Output dimensions
print("Number of rows:", df_output.shape[0])
print("Number of columns:", df_output.shape[1])

         LNAME    FNAME STATE        HPHONE
17      RHODES   JEREMY    NJ  201/812-1837
62     ALVAREZ   CARLOS    NJ  201/732-8787
66       DACKO    JASON    NJ  201/732-2323
69   HENDERSON  WILLIAM    NJ  201/812-4789
72     JOHNSON  JACKSON    NJ  201/732-3678
73     MURPHEY     JOHN    NJ  201/812-4414
74      PETERS  RANDALL    NJ  201/812-2478
77     NEWKIRK  WILLIAM    NJ  201/732-6611
79       ROUSE   JEREMY    NJ  201/732-9834
81    FUJIHARA    KYOKO    NJ  201/812-0902
85        VICK  THERESA    NJ  201/812-2424
92      YANCEY    ROBIN    NJ  201/812-1874
100   LAWRENCE    KATHY    NJ  201/812-3337
101    NEWKIRK   SANDRA    NJ  201/812-3331
109   BAREFOOT   JOSEPH    NJ  201/812-5665
Number of rows: 15
Number of columns: 4

/*=========================*/
 /* LIBNAME Sample 2       */
 /*=========================*/

data work.highwage;
  set samples.SAMDAT5(drop=sex birth hired);
  if salary>60000 then
    CATEGORY='High';
  else if salary<30000 then
    CATEGORY='Low';
  else
    CATEGORY='Avg';
run;

proc print data=work.highwage;
  title 'Libname Sample 2: Salary Analysis';
  format SALARY dollar10.2;
run;

Intent Summary

This SAS code does the following:

Creates a new dataset: It creates a dataset named 'highwage' in the 'work' library.
Data Derivation: This dataset is derived from the 'SAMDAT5' dataset (in the 'samples' library), but it drops the 'sex', 'birth', and 'hired' columns.
Conditional Logic: It adds a new column named 'CATEGORY' and assigns values ('High', 'Low', or 'Avg') based on the value in the 'SALARY' column.
Prints Results: It prints the 'highwage' dataset with a specific format for the 'SALARY' column and a custom title.

In [9]:
# Sample 2: Salary Analysis

import pandas as pd

# Assuming you have df5 loaded from your input mapping

# Create a new DataFrame 
df_highwage = df5.copy()  #  Make a copy to avoid modifying the original

# Drop unnecessary columns
df_highwage.drop(['SEX', 'BIRTH', 'HIRED'], axis=1, inplace=True)

# Conditional logic for 'CATEGORY' column
def categorize_salary(salary):
    if salary > 60000:
        return 'High'
    elif salary < 30000:
        return 'Low'
    else:
        return 'Avg'

df_highwage['CATEGORY'] = df_highwage['SALARY'].apply(categorize_salary)

# Display Result (with formatting)
print(df_highwage.to_string(formatters={'SALARY': '${:,.2f}'.format}))  

# Output dimensions
print("Number of rows:", df_highwage.shape[0])
print("Number of columns:", df_highwage.shape[1])

    IDNUM JOBCODE      SALARY CATEGORY
0    1009     TA1  $28,880.00      Low
1    1017     TA3  $40,858.00      Avg
2    1036     TA3  $39,392.00      Avg
3    1037     TA1  $28,558.00      Low
4    1038     TA1  $26,533.00      Low
5    1050     ME2  $35,167.00      Avg
6    1065     ME2  $35,090.00      Avg
7    1076     PT1  $66,558.00     High
8    1094     FA1  $22,268.00      Low
9    1100     BCK  $25,004.00      Low
10   1101     SCP  $18,723.00      Low
11   1102     TA2  $34,542.00      Avg
12   1103     FA1  $23,738.00      Low
13   1104     SCP  $17,946.00      Low
14   1105     ME2  $34,805.00      Avg
15   1106     PT2  $89,632.00     High
16   1107     PT2  $89,977.00     High
17   1111     NA1  $40,586.00      Avg
18   1112     TA1  $26,905.00      Low
19   1113     FA1  $22,367.00      Low
20   1114     TA2  $32,928.00      Avg
21   1115     FA3  $32,699.00      Avg
22   1116     FA1  $22,862.00      Low
23   1117     TA3  $39,771.00      Avg
24   1118     PT3 $111,379.00     High
25   1119     TA1  $26,924.00      Low
26   1120     ME1  $28,619.00      Low
27   1121     ME1  $29,112.00      Low
28   1122     FA2  $27,956.00      Low
29   1123     TA1  $28,407.00      Low
30   1124     FA1  $23,177.00      Low
31   1125     FA2  $28,888.00      Low
32   1126     TA3  $40,899.00      Avg
33   1127     TA2  $33,011.00      Avg
34   1128     TA2  $32,777.00      Avg
35   1129     ME2  $34,929.00      Avg
36   1130     FA1  $23,916.00      Low
37   1131     TA2  $32,575.00      Avg
38   1132     FA1  $22,413.00      Low
39   1133     TA1  $27,701.00      Low
40   1134     TA2  $33,462.00      Avg
41   1135     FA2  $27,321.00      Low
42   1200     ME1  $27,816.00      Low
43   1221     FA2  $27,896.00      Low
44   1244     ME2  $36,925.00      Avg
45   1269     NA1  $41,690.00      Avg
46   1292     ME2  $36,691.00      Avg
47   1332     NA1  $42,178.00      Avg
48   1333     PT2  $88,606.00     High
49   1347     TA3  $40,079.00      Avg
50   1350     FA3  $32,886.00      Avg
51   1352     NA2  $53,798.00      Avg
52   1354     SCP  $18,335.00      Low
53   1356     ME2  $36,869.00      Avg
54   1368     FA2  $27,808.00      Low
55   1369     TA2  $33,705.00      Avg
56   1379     ME3  $42,264.00      Avg
57   1383     BCK  $25,823.00      Low
58   1385     ME3  $43,900.00      Avg
59   1389     BCK  $25,028.00      Low
60   1390     FA2  $27,761.00      Low
61   1400     ME1  $29,769.00      Low
62   1401     TA3  $38,822.00      Avg
63   1402     TA2  $32,615.00      Avg
64   1403     ME1  $28,072.00      Low
65   1404     PT2  $91,376.00     High
66   1405     SCP  $18,056.00      Low
67   1406     ME2  $35,185.00      Avg
68   1407     PT1  $68,096.00     High
69   1408     TA2  $34,138.00      Avg
70   1409     ME3  $41,551.00      Avg
71   1410     PT2  $84,685.00     High
72   1411     FA2  $27,265.00      Low
73   1412     ME1  $27,799.00      Low
74   1413     FA2  $27,435.00      Low
75   1414     FA1  $23,644.00      Low
76   1415     FA2  $28,278.00      Low
77   1417     NA2  $52,270.00      Avg
78   1418     ME1  $28,005.00      Low
79   1420     ME3  $43,071.00      Avg
80   1421     TA2  $33,155.00      Avg
81   1422     FA1  $22,454.00      Low
82   1423     ME2  $35,773.00      Avg
83   1424     FA2  $28,978.00      Low
84   1425     FA1  $23,979.00      Low
85   1426     TA2  $32,991.00      Avg
86   1427     TA2  $34,046.00      Avg
87   1428     PT1  $68,767.00     High
88   1429     TA1  $27,939.00      Low
89   1430     TA2  $32,925.00      Avg
90   1431     FA3  $33,230.00      Avg
91   1432     ME2  $35,327.00      Avg
92   1433     FA3  $32,982.00      Avg
93   1434     FA2  $28,622.00      Low
94   1435     TA3  $38,808.00      Avg
95   1436     TA2  $34,475.00      Avg
96   1437     FA3  $33,104.00      Avg
97   1438     TA3  $39,223.00      Avg
98   1439     PT1  $70,736.00     High
99   1440     ME2  $35,757.00      Avg
100  1441     FA2  $27,158.00      Low
101  1442     PT2  $84,536.00     High
102  1443     NA1  $42,274.00      Avg
103  1475     FA2  $27,787.00      Low
104  1476     TA2  $34,803.00      Avg
105  1477     FA2  $28,566.00      Low
106  1478     PT2  $84,203.00     High
107  1479     TA3  $38,785.00      Avg
108  1480     TA3  $39,583.00      Avg
109  1499     ME3  $43,025.00      Avg
110  1521     ME3  $41,526.00      Avg
111  1545     PT1  $66,130.00     High
112  1555     FA2  $27,499.00      Low
113  1556     PT1  $71,349.00     High
114  1561     TA2  $34,514.00      Avg
115  1564     SCP  $18,833.00      Low
116  1574     FA2  $28,572.00      Low
117  1616     TA2  $34,137.00      Avg
118  1639     TA3  $40,260.00      Avg
119  1653     ME2  $35,108.00      Avg
120  1658     SCP  $17,943.00      Low
121  1663     BCK  $26,452.00      Low
122  1673     BCK  $25,477.00      Low
123  1677     BCK  $26,007.00      Low
124  1704     BCK  $25,465.00      Low
125  1739     PT1  $66,517.00     High
126  1777     PT3 $109,630.00     High
127  1782     ME2  $35,345.00      Avg
128  1789     SCP  $18,326.00      Low
129  1830     PT2  $84,471.00     High
130  1834     BCK  $26,896.00      Low
131  1839     NA1  $43,433.00      Avg
132  1845     BCK  $25,996.00      Low
133  1876     TA3  $39,675.00      Avg
134  1882     ME3  $41,538.00      Avg
135  1890     PT2  $91,908.00     High
136  1900     ME2  $35,105.00      Avg
137  1905     PT1  $65,111.00     High
138  1907     TA2  $33,329.00      Avg
139  1908     TA2  $32,995.00      Avg
140  1919     TA2  $34,376.00      Avg
141  1928     PT2  $89,858.00     High
142  1935     NA2  $51,081.00      Avg
143  1970     FA1  $22,615.00      Low
144  1983     FA3  $33,419.00      Avg
145  1988     FA3  $32,217.00      Avg
146  1991     TA1  $27,645.00      Low
147  1995     ME1  $28,810.00      Low
Number of rows: 148
Number of columns: 4

/*=========================*/
 /* LIBNAME Sample 3       */
 /*=========================*/

 data work.combined;
  merge samples.SAMDAT7 samples.SAMDAT8(in=super
    rename=(SUPID=IDNUM));
  by IDNUM;
  if super;
run;

proc print data=work.combined;
  title 'Libname Sample 3: Supervisor Information';
run;

This SAS code does the following:

Merges Datasets: It merges two datasets, 'SAMDAT7' and 'SAMDAT8' (both in the 'samples' library), into a new dataset named 'combined' in the 'work' library.
Join Condition: The merge is performed using the 'IDNUM' column as the common key for joining.
Renaming: The 'SUPID' column from 'SAMDAT8' is renamed to 'IDNUM' during the merge.
Filtering: The if super; statement filters the merged dataset to include only rows where a variable named 'super' has a truthy value (likely indicating supervisor status).
Prints Results: Prints the 'combined' dataset with a custom title.

In [48]:
print(df7)
print(df8)

    IDNUM      LNAME      FNAME        CITY STATE        HPHONE
0    1009     MORGAN     GEORGE    NEW YORK    NY  212/586-7753
1    1017      WELCH     DARIUS    NEW YORK    NY  212/586-5535
2    1036       WONG     LESLIE    NEW YORK    NY  212/587-2570
3    1037       CHOW       JANE    STAMFORD    CT  203/781-8868
4    1038  RODRIGUEZ      MARIA  BRIDGEPORT    CT  203/675-2048
..    ...        ...        ...         ...   ...           ...
143  1970     PARKER       ANNE    NEW YORK    NY  718/383-3895
144  1983       DEAN     SHARON    NEW YORK    NY  718/384-1647
145  1988     COOPER    ANTHONY    NEW YORK    NY  212/587-1228
146  1991     HOWARD   GRETCHEN  BRIDGEPORT    CT  203/675-0007
147  1995     VARNER  ELIZABETH    NEW YORK    NY  718/384-7113

[148 rows x 6 columns]
   SUPID STATE JOBCAT
0   1106    CT     PT
1   1118    NY     PT
2   1126    NY     TA
3   1352    NY     NA
4   1385    CT     ME
5   1401    NJ     TA
6   1405    NJ     SC
7   1417    NJ     NA
8   1420    NJ     ME
9   1431    CT     FA
10  1433    NJ     FA
11  1442    NJ     PT
12  1564    NY     SC
13  1639    CT     TA
14  1677    CT     BC
15  1834    NY     BC
16  1882    NY     ME
17  1935    CT     NA
18  1983    NY     FA

In [33]:
# Sample 3: Supervisor Information

import pandas as pd

# Merge DataFrames, renaming 'SUPID' from df8 to 'IDNUM'
df_combined = pd.merge(df7, df8.rename(columns={'SUPID': 'IDNUM'}), on='IDNUM', how='inner')

# Filter based on likely scenarios

# Scenario 1: If 'super' was intended as a boolean filter
if 'SUPER' in df_combined.columns:  # Checking for case-insensitive existence
    df_filtered = df_combined[df_combined['SUPER'] == True] 
else:
    print("Column 'super' (or a case variant) not found. Filtering skipped.")

# Scenario 2: If 'super' indicates presence in SAMDAT8, create a similar column
df_combined['SUPER'] = True  # Assuming all merged rows originated in SAMDAT8

# Display Result (assuming you want all columns of the filtered data)
print(df_filtered) 

# Output dimensions
print("Number of rows:", df_filtered.shape[0])
print("Number of columns:", df_filtered.shape[1])

Column 'super' (or a case variant) not found. Filtering skipped.
    IDNUM         LNAME      FNAME          CITY STATE        HPHONE SEX  \
1    1017         WELCH     DARIUS      NEW YORK    NY  212/586-5535   M
7    1076        VENTER    RANDALL      NEW YORK    NY  718/383-2321   M
15   1106     MARSHBURN     JASPER      STAMFORD    CT  203/781-1457   M
16   1107      THOMPSON      WAYNE      NEW YORK    NY  718/384-3785   M
17   1111        RHODES     JEREMY     PRINCETON    NJ  201/812-1837   M
24   1118        DENNIS      ROGER      NEW YORK    NY  718/383-1122   M
32   1126        KIMANI       ANNE      NEW YORK    NY  212/586-1229   F
45   1269        CASTON   FRANKLIN      STAMFORD    CT  203/781-3335   M
47   1332    STEPHENSON       ADAM    BRIDGEPORT    CT  203/675-1497   M
48   1333      BANADYGA     JUSTIN      STAMFORD    CT  203/781-1777   M
49   1347        O'NEAL      BRYAN      NEW YORK    NY  718/384-0230   M
51   1352        RIVERS      SIMON      NEW YORK    NY  718/383-3345   M
56   1379        MORGAN     ALFRED      STAMFORD    CT  203/781-2216   M
58   1385        RAYNOR     MILTON    BRIDGEPORT    CT  203/675-2846   M
65   1404         COHEN        LEE      NEW YORK    NY  718/384-2946   M
68   1407     GREGORSKI     DANIEL    MT. VERNON    NY  914/468-1616   M
70   1409       HAVELKA    RAYMOND      STAMFORD    CT  203/781-9697   M
71   1410        HARRIS    CHARLES      STAMFORD    CT  203/781-0937   M
77   1417       NEWKIRK    WILLIAM      PATERSON    NJ  201/732-6611   M
79   1420         ROUSE     JEREMY      PATERSON    NJ  201/732-9834   M
87   1428         BRADY  CHRISTINE      STAMFORD    CT  203/781-1212   F
98   1439    HASENHAUER  CHRISTINA    BRIDGEPORT    CT  203/675-4987   F
101  1442       NEWKIRK     SANDRA     PRINCETON    NJ  201/812-3331   F
102  1443         WELLS      AGNES      STAMFORD    CT  203/781-5546   F
106  1478        NEWTON      JAMES      NEW YORK    NY  212/587-5549   M
109  1499      BAREFOOT     JOSEPH     PRINCETON    NJ  201/812-5665   M
110  1521        PARKER        JAY      NEW YORK    NY  212/587-7603   M
111  1545       HERRERO      CLYDE      STAMFORD    CT  203/781-1119   M
113  1556    PENNINGTON    MICHAEL      NEW YORK    NY  718/383-5681   M
118  1639  CARTER-COHEN      KAREN      STAMFORD    CT  203/781-8839   F
125  1739    BRANCACCIO     JOSEPH      NEW YORK    NY  212/587-1247   M
126  1777        LUFKIN        ROY      NEW YORK    NY  718/383-4413   M
129  1830         TRIPP      KATHY    BRIDGEPORT    CT  203/675-2479   F
131  1839        NORRIS      DIANE      NEW YORK    NY  718/384-1767   F
134  1882        TUCKER       ALAN      NEW YORK    NY  718/384-0216   M
135  1890    STEPHENSON     ROBERT      NEW YORK    NY  718/384-9874   M
137  1905        GRAHAM      ALVIN      NEW YORK    NY  212/586-8815   M
141  1928      UPCHURCH      LARRY  WHITE PLAINS    NY  914/455-5009   M
142  1935     FERNANDEZ    KATRINA    BRIDGEPORT    CT  203/675-2962   F

    JOBCODE    SALARY      BIRTH      HIRED
1       TA3   40858.0 1957-12-28 1981-10-16
7       PT1   66558.0 1955-10-14 1991-10-03
15      PT2   89632.0 1957-11-06 1984-08-16
16      PT2   89977.0 1954-06-09 1979-02-10
17      NA1   40586.0 1973-07-14 1992-10-31
24      PT3  111379.0 1944-01-16 1980-12-18
32      TA3   40899.0 1963-05-28 1980-11-21
45      NA1   41690.0 1972-05-03 1992-11-28
47      NA1   42178.0 1970-09-17 1991-06-04
48      PT2   88606.0 1961-03-30 1981-02-10
49      TA3   40079.0 1967-09-21 1984-09-06
51      NA2   53798.0 1960-12-02 1986-10-16
56      ME3   42264.0 1961-08-08 1984-06-10
58      ME3   43900.0 1962-01-16 1986-04-01
65      PT2   91376.0 1953-02-24 1980-01-01
68      PT1   68096.0 1969-03-23 1990-03-18
70      ME3   41551.0 1950-04-19 1981-10-22
71      PT2   84685.0 1967-05-03 1986-11-07
77      NA2   52270.0 1964-06-27 1989-03-07
79      ME3   43071.0 1965-02-19 1987-07-22
87      PT1   68767.0 1960-04-04 1991-11-16
98      PT1   70736.0 1964-03-06 1990-09-10
101     PT2   84536.0 1966-09-05 1988-04-12
102     NA1   42274.0 1968-11-17 1991-08-29
106     PT2   84203.0 1959-08-09 1990-10-24
109     ME3   43025.0 1954-04-26 1980-06-07
110     ME3   41526.0 1963-04-12 1988-07-13
111     PT1   66130.0 1959-08-12 1990-05-29
113     PT1   71349.0 1964-06-22 1991-12-11
118     TA3   40260.0 1957-06-26 1984-01-28
125     PT1   66517.0 1964-12-25 1991-01-27
126     PT3  109630.0 1951-09-23 1981-06-21
129     PT2   84471.0 1957-05-27 1983-01-29
131     NA1   43433.0 1970-11-29 1993-07-03
134     ME3   41538.0 1957-07-10 1978-11-21
135     PT2   91908.0 1951-07-20 1979-11-25
137     PT1   65111.0 1972-04-16 1992-05-29
141     PT2   89858.0 1954-09-16 1990-07-13
142     NA2   51081.0 1954-03-28 1981-10-16
Number of rows: 39
Number of columns: 11

 /*=========================*/
 /* LIBNAME Sample 4       */
 /*=========================*/

data work.payroll;
  update samples.SAMDAT5
         samples.SAMDAT6;
  by IDNUM;
run;

proc print data=work.payroll;
  title 'Libname Sample 4: Updated Payroll Data';
run;

Intent Summary

This SAS code aims to:

Update Dataset: It updates the 'payroll' dataset in the 'work' library by combining information from two datasets: 'SAMDAT5' and 'SAMDAT6' (both in the 'samples' library).
Join Condition: The update is performed by matching records based on the 'IDNUM' column.
Print Results: It prints the updated 'payroll' dataset with a custom title.

In [11]:
# Sample 4: Updated Payroll Data

import pandas as pd

# 1. Updating logic - You'll need to define this based on how you want to update the 'payroll' dataset

def update_payroll(df_payroll, df5, df6):
    # ... Your logic to update df_payroll based on values in df5 and df6
    # Example: Adding a new column from df6
    df_payroll['NEW_COLUMN'] = df6['NEW_COLUMN'] 
    return df_payroll

# Assuming 'df_payroll' exists (either loaded or created as a copy of df5)
df_payroll = update_payroll(df_payroll.copy(), df5, df6) 

# Display Result
print(df_payroll)

# Output dimensions
print("Number of rows:", df_payroll.shape[0])
print("Number of columns:", df_payroll.shape[1])

NameError: name 'df_payroll' is not defined

In [ ]:
# Sample 4: Updated Payroll Data

import pandas as pd

# 1. Updating logic 
def update_payroll(df_base, df5, df6):
    # ... Your logic to update df_base based on values in df5 and df6

    # Example 1: Adding a column directly from df6
    df_base['NEW_COLUMN'] = df6['NEW_COLUMN']  

    # Example 2: Update with conditions (assuming both df5 and df_base have 'SALARY')
    df_base.loc[df_base['IDNUM'].isin(df5['IDNUM']), 'SALARY'] = df5['SALARY']

    return df_base

# 2. Decide your base dataset
base_dataset = 'df5'  # Option 1: Start with df5 and update
# base_dataset = 'df6'  # Option 2: Start with df6 and update

# 3. Load or create the base DataFrame
if base_dataset == 'df5':
    df_payroll = df5.copy()
else: 
    df_payroll = df6.copy()

# 4. Update
df_payroll = update_payroll(df_payroll, df5, df6) 

# Display Result, dimensions, etc. (rest of your code remains the same)

 /*=========================*/
 /* LIBNAME Sample 5       */
 /*=========================*/
title 'Libname Sample 5: Total Salary by Jobcode';

proc sql;
  select JOBCODE label='Jobcode',
         sum(SALARY) as total
         label='Total for Group'
         format=dollar11.2
  from samples.SAMDAT5
  group by JOBCODE;
quit;

Intent Summary

This SAS code calculates the total salary for each unique job code in the 'SAMDAT5' dataset (located in the 'samples' library). It also adds labels and formats the output.

In [12]:
# Sample 5: Total Salary by Jobcode

import pandas as pd

# SQL equivalent in Python using Pandas
df_grouped = df5.groupby('JOBCODE')['SALARY'].sum()
df_grouped = df_grouped.reset_index()  # Reset index to create separate columns
df_grouped.columns = ['Jobcode', 'Total for Group']  # Rename columns for clarity
df_grouped['Total for Group'] = df_grouped['Total for Group'].apply('${:,.2f}'.format)  # Format currency

# Display result
print(df_grouped.to_string(index=False))  # Print without index

# Output dimensions
print("Number of rows:", df_grouped.shape[0])
print("Number of columns:", df_grouped.shape[1])

Jobcode Total for Group
    BCK     $232,148.00
    FA1     $253,433.00
    FA2     $447,790.00
    FA3     $230,537.00
    ME1     $228,002.00
    ME2     $498,076.00
    ME3     $296,875.00
    NA1     $210,161.00
    NA2     $157,149.00
    PT1     $543,264.00
    PT2     $879,252.00
    PT3     $221,009.00
    SCP     $128,162.00
    TA1     $249,492.00
    TA2     $671,499.00
    TA3     $476,155.00
Number of rows: 16
Number of columns: 2

 /*=========================*/
 /* LIBNAME Sample 6       */
 /*=========================*/

title 'Libname Sample 6: Flights to London and Frankfurt';

proc sql;
  select DATES, DEST from samples.SAMDAT2
  where (DEST eq "FRA") or
    (DEST eq "LON")
  order by DEST;
quit;

Intent Summary

This SAS code does the following:

Filters Data: It selects the 'DATES' and 'DEST' columns from the 'SAMDAT2' dataset (located in the 'samples' library) where the 'DEST' column is either "FRA" (Frankfurt) or "LON" (London).
Sorts Results: The results are ordered alphabetically by the 'DEST' column.

In [13]:
# Sample 6: Flights to London and Frankfurt

import pandas as pd

# Filter for flights to Frankfurt or London
df_filtered = df2[df2['DEST'].isin(['FRA', 'LON'])]

# Select and sort
df_output = df_filtered[['DATES', 'DEST']].sort_values(by='DEST')

# Display result
print(df_output)

# Output dimensions
print("Number of rows:", df_output.shape[0])
print("Number of columns:", df_output.shape[1])

        DATES DEST
3  1998-03-01  FRA
10 1998-03-02  FRA
17 1998-03-03  FRA
24 1998-03-04  FRA
31 1998-03-05  FRA
42 1998-03-07  FRA
2  1998-03-01  LON
9  1998-03-02  LON
16 1998-03-03  LON
23 1998-03-04  LON
30 1998-03-05  LON
36 1998-03-06  LON
41 1998-03-07  LON
Number of rows: 13
Number of columns: 2

 /*=========================*/
 /* LIBNAME Sample 7       */
 /*=========================*/

proc sql;
   title  'Libname Sample 7: International Flights by Flight Number';
   title2 'with Over 200 Passengers';
   select FLIGHT   label="Flight Number",
          DATES    label="Departure Date",
          DEST     label="Destination",
          BOARDED  label="Number Boarded"
     from samples.SAMDAT3
    where BOARDED > 200
    order by FLIGHT;
quit;

Intent Summary

This SAS code does the following:

Filters Data: Selects data from the 'SAMDAT3' dataset (located in the 'samples' library) where the 'BOARDED' column is greater than 200 (representing international flights with a high passenger count).
Selects Columns/Labels: Selects specific columns ('FLIGHT', 'DATES', 'DEST', 'BOARDED'), applying custom labels for clarity.
Orders Results: Sorts the output by the 'FLIGHT' column.
Adds Titles: Adds a main title and a subtitle to the output.

In [14]:
# Sample 7: International Flights by Flight Number with Over 200 Passengers

import pandas as pd

# Filter the data
df_filtered = df3[df3['BOARDED'] > 200]

# Select columns and rename
df_output = df_filtered[['FLIGHT', 'DATES', 'DEST', 'BOARDED']]
df_output.columns = ['Flight Number', 'Departure Date', 'Destination', 'Number Boarded']

# Sort results
df_output = df_output.sort_values(by='Flight Number')

# Display result (handling titles separately)
print('Libname Sample 7: International Flights by Flight Number') 
print('with Over 200 Passengers')
print(df_output)

# Output dimensions
print("Number of rows:", df_output.shape[0])
print("Number of columns:", df_output.shape[1])

Libname Sample 7: International Flights by Flight Number
with Over 200 Passengers
   Flight Number Departure Date Destination  Number Boarded
12           219     1998-03-04         LON           232.0
22           219     1998-03-07         LON           241.0
1            622     1998-03-01         FRA           207.0
23           622     1998-03-07         FRA           210.0
Number of rows: 4
Number of columns: 4

 /*=========================*/
 /* LIBNAME Sample 8        */
 /*=========================*/

title 'Libname Sample 8: Employees with salary greater than $40,000';

proc sql;
  select a.LNAME, a.FNAME, b.SALARY
    format=dollar10.2
  from samples.SAMDAT7 a, samples.SAMDAT5 b
  where (a.IDNUM eq b.IDNUM) and
    (b.SALARY gt 40000);
quit;

Intent Summary

This code aims to:

Join Datasets: Combines information from 'SAMDAT7' (alias 'a') and 'SAMDAT5' (alias 'b') datasets, located in the 'samples' library, based on a common 'IDNUM' column.
Filter Data: Selects records where the 'SALARY' in the 'SAMDAT5' dataset is greater than $40,000.
Select Columns: Selects the 'LNAME' and 'FNAME' columns from 'SAMDAT7' and the 'SALARY' column from 'SAMDAT5', applying formatting to the 'SALARY'.

In [15]:
# Sample 8: Employees with salary greater than $40,000

import pandas as pd

# Join DataFrames on 'IDNUM'
df_joined = pd.merge(df7, df5, on='IDNUM', how='inner')

# Filter for salary 
df_filtered = df_joined[df_joined['SALARY'] > 40000]

# Select columns
df_output = df_filtered[['LNAME', 'FNAME', 'SALARY']]

# Format SALARY column
df_output['SALARY'] = df_output['SALARY'].apply('${:,.2f}'.format)

# Display results
print('Libname Sample 8: Employees with salary greater than $40,000')
print(df_output)

# Output dimensions
print("Number of rows:", df_output.shape[0])
print("Number of columns:", df_output.shape[1])

Libname Sample 8: Employees with salary greater than $40,000
            LNAME      FNAME       SALARY
1           WELCH     DARIUS   $40,858.00
7          VENTER    RANDALL   $66,558.00
15      MARSHBURN     JASPER   $89,632.00
16       THOMPSON      WAYNE   $89,977.00
17         RHODES     JEREMY   $40,586.00
24         DENNIS      ROGER  $111,379.00
32         KIMANI       ANNE   $40,899.00
45         CASTON   FRANKLIN   $41,690.00
47     STEPHENSON       ADAM   $42,178.00
48       BANADYGA     JUSTIN   $88,606.00
49         O'NEAL      BRYAN   $40,079.00
51         RIVERS      SIMON   $53,798.00
56         MORGAN     ALFRED   $42,264.00
58         RAYNOR     MILTON   $43,900.00
65          COHEN        LEE   $91,376.00
68      GREGORSKI     DANIEL   $68,096.00
70        HAVELKA    RAYMOND   $41,551.00
71         HARRIS    CHARLES   $84,685.00
77        NEWKIRK    WILLIAM   $52,270.00
79          ROUSE     JEREMY   $43,071.00
87          BRADY  CHRISTINE   $68,767.00
98     HASENHAUER  CHRISTINA   $70,736.00
101       NEWKIRK     SANDRA   $84,536.00
102         WELLS      AGNES   $42,274.00
106        NEWTON      JAMES   $84,203.00
109      BAREFOOT     JOSEPH   $43,025.00
110        PARKER        JAY   $41,526.00
111       HERRERO      CLYDE   $66,130.00
113    PENNINGTON    MICHAEL   $71,349.00
118  CARTER-COHEN      KAREN   $40,260.00
125    BRANCACCIO     JOSEPH   $66,517.00
126        LUFKIN        ROY  $109,630.00
129         TRIPP      KATHY   $84,471.00
131        NORRIS      DIANE   $43,433.00
134        TUCKER       ALAN   $41,538.00
135    STEPHENSON     ROBERT   $91,908.00
137        GRAHAM      ALVIN   $65,111.00
141      UPCHURCH      LARRY   $89,858.00
142     FERNANDEZ    KATRINA   $51,081.00
Number of rows: 39
Number of columns: 3

C:\Users\comma\AppData\Local\Temp\ipykernel_8500\2796675738.py:15: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_output['SALARY'] = df_output['SALARY'].apply('${:,.2f}'.format)

 /*==========================*/
 /* LIBNAME Sample 9         */
 /*==========================*/

/* SQL Implicit Passthru ON */
title 'Libname Sample 9a: Delayed International Flights in March';

proc sql;
  select distinct samdat1.FLIGHT,
      samdat1.DATES,
      DELAY format=2.0
    from samples.SAMDAT1, samples.SAMDAT2, samples.SAMDAT3
  where samdat1.FLIGHT=samdat2.FLIGHT and
        samdat1.DATES=samdat2.DATES and
        samdat1.FLIGHT=samdat3.FLIGHT and
        DELAY>0
  order by DELAY descending;
quit;

Intent Summary

This SAS code aims to:

Join Multiple Datasets: Combines information from 'SAMDAT1', 'SAMDAT2', and 'SAMDAT3' (all in the 'samples' library) based on matching 'FLIGHT' and 'DATES' columns.
Filter for Delays: Selects only records where the 'DELAY' column in 'SAMDAT1' is greater than 0, indicating a delayed flight.
Prioritize International Flights: Implicitly assumes that international flights would be present in the 'SAMDAT2' or 'SAMDAT3' datasets.
Select Columns: Selects and displays 'FLIGHT', 'DATES', and 'DELAY' with formatting applied to the 'DELAY' column.
Order Results:

In [16]:
# Sample 9a: Delayed International Flights in March (Approximate Conversion)

import pandas as pd

# Join datasets (assuming 'FLIGHT' and 'DATES' columns allow for proper matching)
df_joined = pd.merge(df1, df2, on=['FLIGHT', 'DATES'], how='inner')
df_joined = pd.merge(df_joined, df3, on=['FLIGHT', 'DATES'], how='inner')

# Filter for delays
df_filtered = df_joined[df_joined['DELAY'] > 0]

# Select columns and sort
df_output = df_filtered[['FLIGHT', 'DATES', 'DELAY']].sort_values(by='DELAY', ascending=False)

# Display results
print('Libname Sample 9a: Delayed International Flights in March') 
print(df_output)

# Output dimensions
print("Number of rows:", df_output.shape[0])
print("Number of columns:", df_output.shape[1])

Libname Sample 9a: Delayed International Flights in March
   FLIGHT      DATES  DELAY
23    622 1998-03-04   30.0
12    219 1998-03-06   27.0
25    622 1998-03-07   21.0
8     219 1998-03-02   18.0
7     219 1998-03-01   18.0
13    219 1998-03-07   15.0
0     132 1998-03-01   14.0
5     132 1998-03-06    7.0
2     132 1998-03-03    6.0
1     132 1998-03-02    5.0
14    271 1998-03-01    5.0
17    271 1998-03-04    5.0
18    271 1998-03-05    5.0
9     219 1998-03-03    4.0
15    271 1998-03-02    4.0
19    271 1998-03-07    4.0
10    219 1998-03-04    3.0
11    219 1998-03-05    3.0
4     132 1998-03-05    3.0
16    271 1998-03-03    2.0
Number of rows: 20
Number of columns: 3

 /*==========================*/
 /* LIBNAME Sample 9c        */
 /*==========================*/

title 'Libname Sample 9c: Delayed International Flights in March';

proc sql;
  select distinct samdat1.FLIGHT,
      samdat1.DATES,
      DELAY format=2.0
    from samples.SAMDAT1
    full join samples.SAMDAT2 on
      samdat1.FLIGHT = samdat2.FLIGHT
    full join samples.SAMDAT3 on
      samdat1.FLIGHT = samdat3.FLIGHT
  order by DELAY descending;
quit;

Intent Summary

This SAS code modifies the previous example with these key changes:

Full Joins: Utilizes FULL JOIN operations to include flights potentially present in only one of the datasets. This might bring in more flight records than the previous inner joins.
Implicit Filtering: While not explicit, the focus is likely still on delayed international flights. We'll still need to determine how to identify international flights.

In [18]:
# Sample 9c: Delayed International Flights in March (Approximate Conversion)

import pandas as pd

# Join datasets (using 'outer' to approximate FULL JOIN)
df_joined = pd.merge(df1, df2, on='FLIGHT', how='outer')
df_joined = pd.merge(df_joined, df3, on='FLIGHT', how='outer')

# Filter for delays (assuming DELAY comes from df1)
df_filtered = df_joined[df_joined['DELAY'] > 0]

# Select columns and sort
df_output = df_filtered[['FLIGHT', 'DATES', 'DELAY']].sort_values(by='DELAY', ascending=False)

# Display results
print('Libname Sample 9c: Delayed International Flights in March') 
print(df_output)

# Output dimensions
print("Number of rows:", df_output.shape[0])
print("Number of columns:", df_output.shape[1])

Libname Sample 9c: Delayed International Flights in March
     FLIGHT      DATES  DELAY
1090    622 1998-03-01   30.0
1130    622 1998-03-05   30.0
1202    622 1998-03-05   30.0
1201    622 1998-03-04   30.0
1200    622 1998-03-03   30.0
...     ...        ...    ...
1010    302        NaT    1.0
1016    302        NaT    1.0
1022    302        NaT    1.0
1028    302        NaT    1.0
1034    302        NaT    1.0

[922 rows x 3 columns]
Number of rows: 922
Number of columns: 3

/*==========================*/
 /* LIBNAME Sample 10        */
 /*==========================*/

title 'Libname Sample 10: Payrolls 1 & 2';

proc sql;
  select IDNUM, SEX, JOBCODE, SALARY,
         BIRTH,
         HIRED
     from samples.SAMDAT5
  outer union corr
  select *
     from samples.SAMDAT6
   order by IDNUM, JOBCODE, SALARY;
quit;

Intent Summary

This SAS code aims to:

Combine Datasets: Merge information from 'SAMDAT5' and 'SAMDAT6' (both in the 'samples' library) while potentially preserving rows from both datasets even if there are no matches.
Select Columns: Select specific columns: 'IDNUM', 'SEX', 'JOBCODE', 'SALARY', 'BIRTH', and 'HIRED'.
Ordering: Sort the result by 'IDNUM', 'JOBCODE', and 'SALARY' in ascending order.

In [19]:
# Sample 10: Payrolls 1 & 2 

import pandas as pd

# Concatenate DataFrames, potentially including non-matching rows 
df_combined = pd.concat([df5, df6], axis=0, ignore_index=True) 

# Select columns
df_result = df_combined[['IDNUM', 'SEX', 'JOBCODE', 'SALARY', 'BIRTH', 'HIRED']] 

# Sort the results 
df_result = df_result.sort_values(by=['IDNUM', 'JOBCODE', 'SALARY'])

# Display results
print('Libname Sample 10: Payrolls 1 & 2') 
print(df_result)

# Output dimensions
print("Number of rows:", df_result.shape[0])
print("Number of columns:", df_result.shape[1])

Libname Sample 10: Payrolls 1 & 2
    IDNUM SEX JOBCODE   SALARY      BIRTH      HIRED
0    1009   M     TA1  28880.0 1959-03-02 1992-03-26
1    1017   M     TA3  40858.0 1957-12-28 1981-10-16
2    1036   F     TA3  39392.0 1965-05-19 1984-10-23
148  1036   F     TA3  42465.0 1965-05-19 1984-10-23
3    1037   F     TA1  28558.0 1964-04-10 1992-09-13
..    ...  ..     ...      ...        ...        ...
144  1983   F     FA3  33419.0 1962-02-28 1987-04-27
145  1988   M     FA3  32217.0 1959-11-30 1984-09-18
146  1991   F     TA1  27645.0 1972-05-07 1992-12-12
147  1995   F     ME1  28810.0 1973-08-24 1993-09-19
159  1998   M     SCP  23100.0 1970-09-10 1992-11-02

[160 rows x 6 columns]
Number of rows: 160
Number of columns: 6

 /*==========================*/
 /* LIBNAME Sample 11        */
 /*==========================*/

proc sql undo_policy=none;
insert into samples.SAMDAT8
	values('1588','NY','FA');
quit;

proc print data=samples.SAMDAT8;
	title 'Libname Sample 11: New Row in AIRLINE.SAMDAT8';
run;

Intent Summary

This SAS code does the following:
Disables Undo Policy: The statement proc sql undo_policy=none;  temporarily disables the ability to undo this SQL operation. This is often done for performance reasons.
Inserts Data: It inserts a new row with the values '1588', 'NY', and 'FA' into the 'SAMDAT8' dataset (located in the 'samples' library).
Prints Results: Prints the 'SAMDAT8' dataset to display the newly inserted row with a custom title.

In [20]:
# Sample 11: New Row in AIRLINE.SAMDAT8

import pandas as pd

# New row data (assuming df8 has appropriate columns to match these)
new_row = {'IDNUM': '1588', 'STATE': 'NY', 'JOBCODE': 'FA'} # Adjust column names if needed

# **Caution:** Consider the implications of disabling undo behavior in your context. 

# Insert (assumes your DataFrame is tied to a database where this will persist)
df8 = df8.append(new_row, ignore_index=True)

# Display results
print('Libname Sample 11: New Row in AIRLINE.SAMDAT8')
print(df8)

AttributeError: 'DataFrame' object has no attribute 'append'

In [34]:
# Sample 11: New Row in AIRLINE.SAMDAT8

import pandas as pd

# New row data (assuming df8 has appropriate columns to match these)
new_row = {'IDNUM': '1588', 'STATE': 'NY', 'JOBCODE': 'FA'} # Adjust column names if needed

# Create a temporary DataFrame from the new row
temp_df = pd.DataFrame([new_row])

# Concatenate with the original DataFrame
df8 = pd.concat([df8, temp_df], ignore_index=True)

# Display results
print('Libname Sample 11: New Row in AIRLINE.SAMDAT8')
print(df8)

Libname Sample 11: New Row in AIRLINE.SAMDAT8
   SUPID STATE JOBCAT IDNUM JOBCODE
0   1106    CT     PT   NaN     NaN
1   1118    NY     PT   NaN     NaN
2   1126    NY     TA   NaN     NaN
3   1352    NY     NA   NaN     NaN
4   1385    CT     ME   NaN     NaN
5   1401    NJ     TA   NaN     NaN
6   1405    NJ     SC   NaN     NaN
7   1417    NJ     NA   NaN     NaN
8   1420    NJ     ME   NaN     NaN
9   1431    CT     FA   NaN     NaN
10  1433    NJ     FA   NaN     NaN
11  1442    NJ     PT   NaN     NaN
12  1564    NY     SC   NaN     NaN
13  1639    CT     TA   NaN     NaN
14  1677    CT     BC   NaN     NaN
15  1834    NY     BC   NaN     NaN
16  1882    NY     ME   NaN     NaN
17  1935    CT     NA   NaN     NaN
18  1983    NY     FA   NaN     NaN
19   NaN    NY    NaN  1588      FA

 /*==========================*/
 /* LIBNAME Sample 13        */
 /*==========================*/

proc sql;

  create table work.gtforty as
  select LNAME as lastname,
         FNAME as firstname,
         SALARY as Salary
  from samples.SAMDAT7 a, samples.SAMDAT5 b
  where (a.IDNUM eq b.IDNUM) and (SALARY gt 40000);

quit;

proc print data=work.gtforty noobs;
  title 'Libname Sample 13: Employees with salaries over $40,000';
  format SALARY dollar10.2;

run;

Intent Summary

This SAS code does the following:

Creates a New Dataset: It creates a dataset named 'gtforty' in the 'work' library. This dataset is derived from the 'SAMDAT7' and 'SAMDAT5' datasets (both in the 'samples' library).
Filtering and Column Selection: It includes only rows where:
'IDNUM' values match between 'SAMDAT7' and 'SAMDAT5'.
The 'SALARY' (from 'SAMDAT5') is greater than $40,000.
It selects the 'LNAME', 'FNAME', and 'SALARY' columns, renaming them for clarity.
Prints Results: It prints the newly created 'gtforty' dataset with a custom title and formats the 'SALARY' column as currency.

In [21]:
# Sample 13: Employees with salaries over $40,000

import pandas as pd

# Join and filter data
df_joined = pd.merge(df7, df5, on='IDNUM', how='inner')
df_filtered = df_joined[df_joined['SALARY'] > 40000]

# Select and rename columns
df_gtforty = df_filtered[['LNAME', 'FNAME', 'SALARY']]
df_gtforty.columns = ['lastname', 'firstname', 'Salary']

# Format salary
df_gtforty['Salary'] = df_gtforty['Salary'].apply('${:,.2f}'.format)

# Display results
print('Libname Sample 13: Employees with salaries over $40,000')
print(df_gtforty)

# Output dimensions
print("Number of rows:", df_gtforty.shape[0])
print("Number of columns:", df_gtforty.shape[1])

Libname Sample 13: Employees with salaries over $40,000
         lastname  firstname       Salary
1           WELCH     DARIUS   $40,858.00
7          VENTER    RANDALL   $66,558.00
15      MARSHBURN     JASPER   $89,632.00
16       THOMPSON      WAYNE   $89,977.00
17         RHODES     JEREMY   $40,586.00
24         DENNIS      ROGER  $111,379.00
32         KIMANI       ANNE   $40,899.00
45         CASTON   FRANKLIN   $41,690.00
47     STEPHENSON       ADAM   $42,178.00
48       BANADYGA     JUSTIN   $88,606.00
49         O'NEAL      BRYAN   $40,079.00
51         RIVERS      SIMON   $53,798.00
56         MORGAN     ALFRED   $42,264.00
58         RAYNOR     MILTON   $43,900.00
65          COHEN        LEE   $91,376.00
68      GREGORSKI     DANIEL   $68,096.00
70        HAVELKA    RAYMOND   $41,551.00
71         HARRIS    CHARLES   $84,685.00
77        NEWKIRK    WILLIAM   $52,270.00
79          ROUSE     JEREMY   $43,071.00
87          BRADY  CHRISTINE   $68,767.00
98     HASENHAUER  CHRISTINA   $70,736.00
101       NEWKIRK     SANDRA   $84,536.00
102         WELLS      AGNES   $42,274.00
106        NEWTON      JAMES   $84,203.00
109      BAREFOOT     JOSEPH   $43,025.00
110        PARKER        JAY   $41,526.00
111       HERRERO      CLYDE   $66,130.00
113    PENNINGTON    MICHAEL   $71,349.00
118  CARTER-COHEN      KAREN   $40,260.00
125    BRANCACCIO     JOSEPH   $66,517.00
126        LUFKIN        ROY  $109,630.00
129         TRIPP      KATHY   $84,471.00
131        NORRIS      DIANE   $43,433.00
134        TUCKER       ALAN   $41,538.00
135    STEPHENSON     ROBERT   $91,908.00
137        GRAHAM      ALVIN   $65,111.00
141      UPCHURCH      LARRY   $89,858.00
142     FERNANDEZ    KATRINA   $51,081.00
Number of rows: 39
Number of columns: 3

C:\Users\comma\AppData\Local\Temp\ipykernel_8500\214141244.py:14: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_gtforty['Salary'] = df_gtforty['Salary'].apply('${:,.2f}'.format)

 /*==========================*/
 /* LIBNAME Sample 14        */
 /*==========================*/

title 'Libname Sample 14: Number of Passengers per Flight by Date';

proc print data=samples.SAMDAT1 noobs;
  var DATES BOARDED;
  by FLIGHT DEST;
  sumby FLIGHT;
  sum BOARDED;
run;

title 'Libname Sample 14: Maximum Number of Passengers per Flight';

proc means data=samples.SAMDAT1 fw=5 maxdec=1 max;
  var BOARDED;
  class FLIGHT;
run;

Part 1

Calculates Passenger Totals: It calculates the total number of passengers for each combination of 'FLIGHT' and 'DESTINATION' from the 'SAMDAT1' dataset. It also calculates subtotals of passengers for each unique 'FLIGHT'.
Prints Results: Prints the results with a custom title, suppressing the 'obs' column.

In [24]:
# Sample 14: Number of Passengers per Flight by Date, and Maximum Passengers

import pandas as pd

# Part 1: Number of Passengers per Flight by Date
df_grouped = df1.groupby(['FLIGHT', 'DEST'])['BOARDED'].sum()
df_grouped = df_grouped.reset_index()  # Convert group labels into columns

df_subtotals = df1.groupby(['FLIGHT'])['BOARDED'].sum().reset_index()  # Create subtotals by 'FLIGHT'

# Combine grouped results and subtotals, renaming a column for clarity
df_part1 = pd.concat([df_grouped.rename(columns={'BOARDED': 'TOTAL_PER_FLIGHT_DEST'}), subtotals.rename(columns={'BOARDED': 'TOTAL_PER_FLIGHT'})]) 

print('Libname Sample 14: Number of Passengers per Flight by Date')
print(df_part1)

# Output dimensions
print("Number of rows:", df_part1.shape[0])
print("Number of columns:", df_part1.shape[1])

TypeError: Series.rename() got an unexpected keyword argument 'columns'

In [35]:
# Sample 14: Number of Passengers per Flight by Date

import pandas as pd

# Part 1: Number of Passengers per Flight by Date (corrected renaming)
df_grouped = df1.groupby(['FLIGHT', 'DEST'])['BOARDED'].sum().reset_index() 
df_grouped = df_grouped.rename(columns={'BOARDED': 'TOTAL_PER_FLIGHT_DEST'})

df_subtotals = df1.groupby(['FLIGHT'])['BOARDED'].sum().reset_index()
df_subtotals = df_subtotals.rename(columns={'BOARDED': 'TOTAL_PER_FLIGHT'})

df_part1 = pd.concat([df_grouped, df_subtotals], axis=1)  # Concatenate along columns

print('Libname Sample 14: Number of Passengers per Flight by Date')
print(df_part1)

# Output dimensions
print("Number of rows:", df_part1.shape[0])
print("Number of columns:", df_part1.shape[1])

Libname Sample 14: Number of Passengers per Flight by Date
  FLIGHT DEST  TOTAL_PER_FLIGHT_DEST FLIGHT  TOTAL_PER_FLIGHT
0    114  LAX                 1071.0    114            1071.0
1    132  YYZ                  884.0    132             884.0
2    202  ORD                  931.0    202             931.0
3    219  LON                 1338.0    219            1338.0
4    271  PAR                  867.0    271             867.0
5    302  WAS                  622.0    302             622.0
6    622  FRA                 1095.0    622            1095.0
Number of rows: 7
Number of columns: 5

Part 2

Calculates Maximum Passengers: It calculates the maximum number of passengers per 'FLIGHT' from the 'SAMDAT1' dataset.
Formats Output: Specifies display with up to 5 digits before the decimal and a maximum of 1 decimal place.

In [25]:
# Part 2: Maximum Number of Passengers per Flight
df_max = df1.groupby(['FLIGHT'])['BOARDED'].max().reset_index()
df_max['BOARDED'] = df_max['BOARDED'].astype(int)  # Adjust formatting if needed

print('Libname Sample 14: Maximum Number of Passengers per Flight')
print(df_max)

# Output dimensions
print("Number of rows:", df_max.shape[0])
print("Number of columns:", df_max.shape[1])

Libname Sample 14: Maximum Number of Passengers per Flight
  FLIGHT  BOARDED
0    114      197
1    132      164
2    202      175
3    219      241
4    271      177
5    302      135
6    622      210
Number of rows: 7
Number of columns: 2

 /*==========================*/
 /* LIBNAME Sample 16       */
 /*==========================*/

title 'Libname Sample 16: Contents of the SAMDAT2 Table';

proc contents data=samples.SAMDAT2;
run;

Displays Dataset Metadata: It uses the proc contents procedure to generate a report describing the structure of the 'SAMDAT2' dataset (located in the 'samples' library). This includes information like:
Variable/column names
Data types
Column lengths
Dataset attributes (e.g., number of observations)

In [26]:
# Sample 16: Contents of the SAMDAT2 Table

import pandas as pd

# Key Metadata
print(df2.info())  # Information about columns, data types, non-null counts
print(df2.describe())  # Summary statistics for numerical columns 

# Additional Attributes
print("Number of rows:", df2.shape[0])
print("Number of columns:", df2.shape[1])

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 46 entries, 0 to 45
Data columns (total 7 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   FLIGHT    46 non-null     object
 1   DATES     46 non-null     datetime64[ns]
 2   ORIG      46 non-null     object
 3   DEST      46 non-null     object
 4   DELAYCAT  46 non-null     object
 5   DESTYPE   46 non-null     object
 6   DELAY     46 non-null     float64
dtypes: datetime64[ns](1), float64(1), object(5)
memory usage: 2.6+ KB
None
                               DATES      DELAY
count                             46  46.000000
mean   1998-03-03 21:23:28.695652224   4.326087
min              1998-03-01 00:00:00  -6.000000
25%              1998-03-02 00:00:00  -1.000000
50%              1998-03-04 00:00:00   3.000000
75%              1998-03-05 18:00:00   5.750000
max              1998-03-07 00:00:00  30.000000
std                              NaN   8.305432
Number of rows: 46
Number of columns: 7

/*==========================*/
 /* LIBNAME Sample 17        */
 /*==========================*/

title 'Libname Sample 17: Ranking of Delayed Flights';

options pageno=1;

proc rank data=samples.SAMDAT2 descending
    ties=low out=work.ranked;
  var DELAY;
  ranks RANKING;
run;

proc print data=work.ranked;
  format DELAY 2.0;
run;

Intent Summary

This SAS code does the following:

Ranking Delayed Flights:
Ranks flights in the 'SAMDAT2' dataset (from the 'samples' library) based on their 'DELAY' value in descending order (highest delays first).
Handles ties by assigning the lowest rank to all tied observations (ties=low).
Creates a new dataset named 'ranked' in the 'work' library to store the ranking results.
Prints Results:

In [27]:
# Sample 17: Ranking of Delayed Flights

import pandas as pd

# Create a copy to preserve the original data 
df_ranked = df2.copy()

# Ranking (Descending order, ties assigned the lowest rank)
df_ranked['RANKING'] = df_ranked['DELAY'].rank(ascending=False, method='min')

# Print results with formatting (if needed)
df_ranked['DELAY'] = df_ranked['DELAY'].apply('{:.2f}'.format)  

print('Libname Sample 17: Ranking of Delayed Flights')
print(df_ranked)

# Output dimensions
print("Number of rows:", df_ranked.shape[0])
print("Number of columns:", df_ranked.shape[1])

Libname Sample 17: Ranking of Delayed Flights
   FLIGHT      DATES ORIG DEST      DELAYCAT        DESTYPE  DELAY  RANKING
0     114 1998-03-01  LGA  LAX  1-10 Minutes       Domestic   8.00      9.0
1     202 1998-03-01  LGA  ORD      No Delay       Domestic  -5.00     42.0
2     219 1998-03-01  LGA  LON   11+ Minutes  International  18.00      4.0
3     622 1998-03-01  LGA  FRA      No Delay  International  -5.00     42.0
4     132 1998-03-01  LGA  YYZ   11+ Minutes  International  14.00      8.0
5     271 1998-03-01  LGA  PAR  1-10 Minutes  International   5.00     13.0
6     302 1998-03-01  LGA  WAS      No Delay       Domestic  -2.00     36.0
7     114 1998-03-02  LGA  LAX      No Delay       Domestic   0.00     28.0
8     202 1998-03-02  LGA  ORD  1-10 Minutes       Domestic   5.00     13.0
9     219 1998-03-02  LGA  LON   11+ Minutes  International  18.00      4.0
10    622 1998-03-02  LGA  FRA      No Delay  International   0.00     28.0
11    132 1998-03-02  LGA  YYZ  1-10 Minutes  International   5.00     13.0
12    271 1998-03-02  LGA  PAR  1-10 Minutes  International   4.00     19.0
13    302 1998-03-02  LGA  WAS      No Delay       Domestic   0.00     28.0
14    114 1998-03-03  LGA  LAX      No Delay       Domestic  -1.00     32.0
15    202 1998-03-03  LGA  ORD      No Delay       Domestic  -1.00     32.0
16    219 1998-03-03  LGA  LON  1-10 Minutes  International   4.00     19.0
17    622 1998-03-03  LGA  FRA      No Delay  International  -2.00     36.0
18    132 1998-03-03  LGA  YYZ  1-10 Minutes  International   6.00     12.0
19    271 1998-03-03  LGA  PAR  1-10 Minutes  International   2.00     25.0
20    302 1998-03-03  LGA  WAS  1-10 Minutes       Domestic   5.00     13.0
21    114 1998-03-04  LGA  LAX   11+ Minutes       Domestic  15.00      6.0
22    202 1998-03-04  LGA  ORD      No Delay       Domestic  -5.00     42.0
23    219 1998-03-04  LGA  LON  1-10 Minutes  International   3.00     22.0
24    622 1998-03-04  LGA  FRA   11+ Minutes  International  30.00      1.0
25    132 1998-03-04  LGA  YYZ      No Delay  International  -5.00     42.0
26    271 1998-03-04  LGA  PAR  1-10 Minutes  International   5.00     13.0
27    302 1998-03-04  LGA  WAS  1-10 Minutes       Domestic   7.00     10.0
28    114 1998-03-05  LGA  LAX      No Delay       Domestic  -2.00     36.0
29    202 1998-03-05  LGA  ORD  1-10 Minutes       Domestic   2.00     25.0
30    219 1998-03-05  LGA  LON  1-10 Minutes  International   3.00     22.0
31    622 1998-03-05  LGA  FRA      No Delay  International  -6.00     46.0
32    132 1998-03-05  LGA  YYZ  1-10 Minutes  International   3.00     22.0
33    271 1998-03-05  LGA  PAR  1-10 Minutes  International   5.00     13.0
34    114 1998-03-06  LGA  LAX      No Delay       Domestic  -1.00     32.0
35    202 1998-03-06  LGA  ORD      No Delay       Domestic  -3.00     41.0
36    219 1998-03-06  LGA  LON   11+ Minutes  International  27.00      2.0
37    132 1998-03-06  LGA  YYZ  1-10 Minutes  International   7.00     10.0
38    302 1998-03-06  LGA  WAS  1-10 Minutes       Domestic   1.00     27.0
39    114 1998-03-07  LGA  LAX      No Delay       Domestic  -1.00     32.0
40    202 1998-03-07  LGA  ORD      No Delay       Domestic  -2.00     36.0
41    219 1998-03-07  LGA  LON   11+ Minutes  International  15.00      6.0
42    622 1998-03-07  LGA  FRA   11+ Minutes  International  21.00      3.0
43    132 1998-03-07  LGA  YYZ      No Delay  International  -2.00     36.0
44    271 1998-03-07  LGA  PAR  1-10 Minutes  International   4.00     19.0
45    302 1998-03-07  LGA  WAS      No Delay       Domestic   0.00     28.0
Number of rows: 46
Number of columns: 8

/*==========================*/
 /* LIBNAME Sample 18        */
 /*==========================*/

title 'Libname Sample 18: Number of Employees by Jobcode';

proc tabulate data=samples.SAMDAT5 format=3.0;
   class JOBCODE;
   table JOBCODE*n;
   keylabel n="#";
run;

Intent Summary

This SAS code does the following:

Generates Frequency Table: It creates a frequency table from the 'SAMDAT5' dataset (located in the 'samples' library) that counts the number of occurrences of each unique 'JOBCODE'.
Formatting:
It specifies a format of '3.0' for the output, likely controlling the display of the counts.
It customizes the label for the count column to be "#"

In [28]:
# Sample 18: Number of Employees by Jobcode

import pandas as pd

# Create frequency table
freq_table = df5['JOBCODE'].value_counts().reset_index()

# Rename columns for clarity
freq_table.columns = ['JOBCODE', '#']  

# Formatting (adjust as needed, depending on the desired interpretation of 'format=3.0' in SAS)
freq_table['#'] = freq_table['#'].astype(int)  # Example: Display counts as integers

print('Libname Sample 18: Number of Employees by Jobcode')
print(freq_table)

# Output dimensions
print("Number of rows:", freq_table.shape[0])
print("Number of columns:", freq_table.shape[1])

Libname Sample 18: Number of Employees by Jobcode
   JOBCODE   #
0      TA2  20
1      FA2  16
2      ME2  14
3      TA3  12
4      FA1  11
5      PT2  10
6      TA1   9
7      BCK   9
8      PT1   8
9      ME1   8
10     SCP   7
11     FA3   7
12     ME3   7
13     NA1   5
14     NA2   3
15     PT3   2
Number of rows: 16
Number of columns: 2

 /*==========================*/
 /* LIBNAME Sample 19        */
 /*==========================*/

title 'Libname Sample 19: SAMAT5 After Appending SAMDAT6';

proc append base=samples.SAMDAT5
            data=samples.SAMDAT6;
run;

proc print data=samples.SAMDAT5;
run;

Intent Summary

This SAS code does the following:

Appends Datasets: It appends the 'SAMDAT6' dataset onto the end of the 'SAMDAT5' dataset. Both datasets are located in the 'samples' library. Importantly, this modifies the 'SAMDAT5' dataset in-place.
Prints Results: It prints the contents of the modified 'SAMDAT5' dataset to show the results of the append operation.

In [29]:
# Sample 19: SAMDAT5 After Appending SAMDAT6

import pandas as pd

# Append DataFrames 
df5 = df5.append(df6, ignore_index=True) 

# Print the modified df5
print('Libname Sample 19: SAMAT5 After Appending SAMDAT6')
print(df5)

# Output dimensions
print("Number of rows:", df5.shape[0])
print("Number of columns:", df5.shape[1])

AttributeError: 'DataFrame' object has no attribute 'append'

In [36]:
# Sample 19: SAMDAT5 After Appending SAMDAT6

import pandas as pd

# Concatenate DataFrames to create a new one
df_appended = pd.concat([df5, df6], ignore_index=True)

# Print the appended DataFrame
print('Libname Sample 19: SAMAT5 After Appending SAMDAT6')
print(df_appended)

# Output dimensions
print("Number of rows:", df_appended.shape[0])
print("Number of columns:", df_appended.shape[1])

Libname Sample 19: SAMAT5 After Appending SAMDAT6
    IDNUM SEX JOBCODE   SALARY      BIRTH      HIRED
0    1009   M     TA1  28880.0 1959-03-02 1992-03-26
1    1017   M     TA3  40858.0 1957-12-28 1981-10-16
2    1036   F     TA3  39392.0 1965-05-19 1984-10-23
3    1037   F     TA1  28558.0 1964-04-10 1992-09-13
4    1038   F     TA1  26533.0 1969-11-09 1991-11-23
..    ...  ..     ...      ...        ...        ...
155  1369   M     TA3  36598.0 1961-12-28 1987-03-13
156  1447   F     FA1  22123.0 1972-08-07 1992-10-29
157  1561   M     TA3  36514.0 1963-11-30 1987-10-07
158  1639   F     TA3  42260.0 1957-06-26 1984-01-28
159  1998   M     SCP  23100.0 1970-09-10 1992-11-02

[160 rows x 6 columns]
Number of rows: 160
Number of columns: 6

 /*==========================*/
 /* LIBNAME Sample 20        */
 /*==========================*/

title 'Libname Sample 20: Invoice Frequency by Country';

proc freq data=samples.SAMDAT9 (keep=INVNUM COUNTRY);
  tables COUNTRY;
run;

Intent Summary

This SAS code aims to:

Generate Frequency Table: Create a frequency table that counts the occurrences of each unique 'COUNTRY' value within the 'SAMDAT9' dataset (located in the 'samples' library).
Filter Columns: Keep only the 'INVNUM' and 'COUNTRY' columns in the data for this analysis.

In [30]:
# Sample 20: Invoice Frequency by Country

import pandas as pd

# Create frequency table
freq_table = df9[['INVNUM', 'COUNTRY']].groupby('COUNTRY')['INVNUM'].count()
freq_table = freq_table.reset_index(name='COUNT')  # Convert to a DataFrame

print('Libname Sample 20: Invoice Frequency by Country')
print(freq_table)

# Output dimensions
print("Number of rows:", freq_table.shape[0])
print("Number of columns:", freq_table.shape[1])

Libname Sample 20: Invoice Frequency by Country
     COUNTRY  COUNT
0  Argentina      2
1  Australia      1
2     Brazil      4
3        USA     10
Number of rows: 4
Number of columns: 2

 /*==========================*/
 /* LIBNAME Sample 21        */
 /*==========================*/

title 'Libname Sample 21: High Bills--Not Paid';

proc sql;
  create view work.allinv as
  select PAIDON, BILLEDON, INVNUM, AMTINUS, BILLEDTO
    from samples.SAMDAT9 (obs=5);
quit;

data work.notpaid(keep=INVNUM BILLEDTO AMTINUS BILLEDON);

  set work.allinv;
  where PAIDON is missing and AMTINUS>=300000.00;
run;

proc print data=work.notpaid label;
  format AMTINUS dollar20.2;
  label  AMTINUS=amountinus
         BILLEDON=billedon
         INVNUM=invoicenum
         BILLEDTO=billedto;
run;

Intent Summary

This SAS code does the following:

Creates a View: Defines a view named 'allinv' in the 'work' library. This view includes specific columns (PAIDON, BILLEDON, INVNUM, AMTINUS, and BILLEDTO) from the first five observations (obs=5) of the 'SAMDAT9' dataset (located in the 'samples' library).
Filters Data: Creates a new dataset named 'notpaid' in the 'work' library and keeps specific columns. It filters data from the 'allinv' view, selecting rows where:
'PAIDON' is missing.
'AMTINUS' is greater than or equal to 300000.00.
Prints Results: Prints the 'notpaid' dataset with:
Custom formatting for the 'AMTINUS' column.
Custom labels for the columns.

In [31]:
# Sample 21: High Bills -- Not Paid

import pandas as pd

# Simulate the view with filtering for obs=5
df_allinv = df9.head(5)[['PAIDON', 'BILLEDON', 'INVNUM', 'AMTINUS', 'BILLEDTO']]

# Filter for unpaid invoices with high amounts 
df_notpaid = df_allinv[(df_allinv['PAIDON'].isnull()) & (df_allinv['AMTINUS'] >= 300000)]
df_notpaid = df_notpaid[['INVNUM', 'BILLEDTO', 'AMTINUS', 'BILLEDON']] # Keep specific columns

# Format and rename columns
df_notpaid['AMTINUS'] = df_notpaid['AMTINUS'].apply('${:,.2f}'.format)
df_notpaid.rename(columns={'AMTINUS': 'amountinus', 
                           'BILLEDON': 'billedon',
                           'INVNUM': 'invoicenum',
                           'BILLEDTO': 'billedto'}, inplace=True)

print('Libname Sample 21: High Bills -- Not Paid')
print(df_notpaid)

# Output dimensions
print("Number of rows:", df_notpaid.shape[0])
print("Number of columns:", df_notpaid.shape[1])

Libname Sample 21: High Bills -- Not Paid
   invoicenum  billedto      amountinus   billedon
1     11271.0  18543489  $11,063,836.00 1998-10-05
Number of rows: 1
Number of columns: 4

/*==========================*/
 /* LIBNAME Sample 22        */
 /*==========================*/

title 'Libname Sample 22: Interns Who Are Family Members of Employees';


proc sql;
  create view emp_csr as
  select * from samples.SAMDAT10
    where dept in ('CSR010', 'CSR011', 'CSR004');

  select samdat13.LASTNAME, samdat13.FIRSTNAM, samdat13.EMPID,
         samdat13.FAMILYID, samdat13.GENDER,
         samdat13.DEPT, samdat13.HIREDATE
    from emp_csr, samples.samdat13
    where emp_csr.EMPID=samdat13.FAMILYID;
quit;

 Intent Summary

This SAS code does the following:

Creates a View: Defines a view named 'emp_csr' in the 'work' library. This view includes all columns from the 'SAMDAT10' dataset, filtered to include only employees in specific departments ('CSR010', 'CSR011', 'CSR004').
Joins Datasets and Filters:
Joins the 'emp_csr' view with the 'SAMDAT13' dataset based on the condition that the 'EMPID' in 'emp_csr' matches the 'FAMILYID' in 'SAMDAT13'. This likely aims to identify employees in customer service related departments ('emp_csr') who have family relationships indicated in 'SAMDAT13'.
Selects specific columns for the output.

In [32]:
# Sample 22: Interns Who Are Family Members of Employees 

import pandas as pd

# Create the 'emp_csr' view
df_emp_csr = df10[df10['DEPT'].isin(['CSR010', 'CSR011', 'CSR004'])]

# Join and filter
df_result = pd.merge(df_emp_csr, df13, on='EMPID', how='inner')

# Select columns
df_result = df_result[['LASTNAME', 'FIRSTNAM', 'EMPID', 'FAMILYID', 'Gender', 'DEPT', 'HIREDATE']]

print('Libname Sample 22: Interns Who Are Family Members of Employees')
print(df_result)

# Output dimensions
print("Number of rows:", df_result.shape[0])
print("Number of columns:", df_result.shape[1])

KeyError: "['LASTNAME', 'Gender', 'DEPT', 'HIREDATE'] not in index"

In [37]:
# Sample 22: Interns Who Are Family Members of Employees 

import pandas as pd

# Create the 'emp_csr' view
df_emp_csr = df10[df10['DEPT'].isin(['CSR010', 'CSR011', 'CSR004'])]

# Join and filter (assuming you want to keep the FAMILYID from df_emp_csr)
df_result = pd.merge(df_emp_csr[['EMPID', 'FAMILYID']], df13, on='FAMILYID', how='inner')

# Select columns (ensure these names actually exist in your df_result)
df_result = df_result[['LASTNAME', 'FIRSTNAM', 'EMPID', 'FAMILYID', 'GENDER', 'DEPT', 'HIREDATE']]

print('Libname Sample 22: Interns Who Are Family Members of Employees')
print(df_result)

# Output dimensions
print("Number of rows:", df_result.shape[0])
print("Number of columns:", df_result.shape[1])

KeyError: "['FAMILYID'] not in index"